InterviewPreparationCSS.tex
% Created 2021-05-20 Thu 20:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[top=0.5in, left=0.5in, bottom=0.5in, right=0.5in]{geometry}
\date{}
\title{Interview Question Css}
\hypersetup{
 pdfauthor={Abul Kalam Robin},
 pdftitle={Interview Question Css},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{CSS interview questions}
\label{sec:orgb28bc89}
\begin{enumerate}
\item What is CSS
\item What is the Box model in CSS?
\item Which CSS properties are a part of Box model?
\item What does float do?
\item How can you clear sides of a floating element?
\item some tricky questions in rapid fire style.
\item Are CSS rule names case sensitive?
\item Why CSS selectors mixed up with cases don't apply the styles?
\item Does margin-top or margin-bottom has effect on inline element?
\item Does padding-top or padding-bottom has effect on inline element?
\item does padding-left or padding-right or margin-left or margin-right has effect on inline element?
\item If you have a <p> element with font-size: 10rem, will the text be responsive when the user resizes / drags the browser window?
\item The pseudo class :checked will select inputs with type radio or checkbox, but not <option> elements.
\item In a HTML document, the pseudo class :root always refers to the <html> element.
\item The translate() function can move the position of an element on the z-axis.
\item Which one would you prefer among px, em \% or pt and why?
\item How absolute, relative, fixed and static position differ?
\item What are the differences between visibility: hidden and display: none?
\item What are the differences between inline, block and inline-block?
\item What are the properties related to box model?
\item Does overflow: hidden create a new block formatting
\item How could you apply CSS rules specific to a media?
\item What is the use of only?
\item Does the screen keyword apply to the device's physical screen or the browser's viewport?
\item What are the some pseudo classes you have used?
\item How do you align a p center-center inside a div?
\item How do you optimize CSS selectors?
\item How can you load CSS resources conditionally?
\item How would you use sprites?
\item What is specificity? How do you calculate specificity?
\item What is shadow DOM?
\item What do you know about transition?
\item What are the different CSS filter you can use?
\item What are the reasons to use preprocessor?
\item Show you couple of style example and you have to tell what does it do.
\item What are the advantages of using CSS?
\item What are the limitations of CSS?
\item How to include CSS in the webpage?
\end{enumerate}
\end{document}
